In [141]:
import pandas as pd
import numpy as np
import random

# Turning dictionaries into DataFrames

In [14]:
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}

In [17]:
test = pd.DataFrame(studentData)

In [18]:
test

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york

In [27]:
dictionary1 = {'1' : ['one', 'ten', 'one hundred'], '2' : ['two', 'twenty', 'two hundred']}

In [28]:
test2 = pd.DataFrame(dictionary1)

In [29]:
test2

             1            2
0          one          two
1          ten       twenty
2  one hundred  two hundred

Each key in the dictionary becomes the column heading - unless I tell it to rename the indexes, it will default to index from 0, whereas I want the rows to be the letters!

In [256]:
board= {
    '1' : ['.', '.', '.', '.', '.'], 
    '2' : ['.', '.', '.', '.', '.'], 
    '3' : ['.', '.', '.', '.', '.'], 
    '4' : ['.', '.', '.', '.', '.'], 
    '5' : ['.', '.', '.', '.', '.']
}

In [257]:
empty_board = pd.DataFrame(board, index = ['A','B','C','D','E'])

In [258]:
empty_board

   1  2  3  4  5
A  .  .  .  .  .
B  .  .  .  .  .
C  .  .  .  .  .
D  .  .  .  .  .
E  .  .  .  .  .

Alternatively, I can tell it to treat the keys as the index, in effect transposing it

In [239]:
board2= {
    'A' : ['.', '.', '.', '.', '.'], 
    'B' : ['.', '.', '.', '.', '.'], 
    'C' : ['.', '.', '.', '.', '.'], 
    'D' : ['.', '.', '.', '.', '.'], 
    'E' : ['.', '.', '.', '.', '.']
}

In [240]:
empty_board2 = pd.DataFrame.from_dict(board2, orient='index')

In [241]:
empty_board2

   0  1  2  3  4
A  .  .  .  .  .
B  .  .  .  .  .
C  .  .  .  .  .
D  .  .  .  .  .
E  .  .  .  .  .

... or simply use the transpose function. Only thing to note here is that given it automatically indexes the rows, they start at 0, whereas it automatically numbers columns from 1.

In [59]:
empty_board3 = empty_board2.transpose()

In [60]:
empty_board3

   A  B  C  D  E
0  .  .  .  .  .
1  .  .  .  .  .
2  .  .  .  .  .
3  .  .  .  .  .
4  .  .  .  .  .

# Changing values within the Dataframe

In [259]:
empty_board.at['A', '4'] = 'X'

In [260]:
empty_board

   1  2  3  4  5
A  .  .  .  X  .
B  .  .  .  .  .
C  .  .  .  .  .
D  .  .  .  .  .
E  .  .  .  .  .

# Reading a csv file

In [115]:
file = pd.read_csv(r"C:\Users\Annabel\Documents\Code\practiceprojects\catsvdogs.csv")

In [262]:
print(file.head(5))

     Location Number of Households (in 1000)  \
0     Alabama                          1,828
1     Arizona                          2,515
2    Arkansas                           1148
3  California                         12,974
4    Colorado                          1,986

   Percentage of households with pets Number of Pet Households (in 1000)  \
0                                59.5                              1,088
1                                59.5                              1,497
2                                62.4                                716
3                                52.9                              6,865
4                                61.3                              1,217

   Percentage of Dog Owners Dog Owning Households (1000s)  \
0                      44.1                           807
1                      40.1                         1,008
2                      47.9                           550
3                      32.8                         4,260
4                      42.5                           845

   Mean Number of Dogs per household Dog Population (in 1000)  \
0                                1.7                    1,410
1                                1.8                    1,798
2                                2.0                    1,097
3                                1.6                    6,687
4                                1.6                    1,349

   Percentage of Cat Owners Cat Owning Households  Mean Number of Cats  \
0                      27.4                   501                  2.5
1                      29.6                   743                  1.9
2                      30.6                   351                  2.3
3                      28.3                 3,687                  1.9
4                      32.3                   642                  1.9

  Cat Population  Unnamed: 12
0          1,252          NaN
1          1,438          NaN
2            810          NaN
3          7,118          NaN
4           1191          NaN

In [135]:
print('Cats by State\n', file.head(5)['Location'] + ':    ' + file.head(5)['Cat Population'])

Cats by State
 0       Alabama:    1,252
1       Arizona:    1,438
2        Arkansas:    810
3    California:    7,118
4       Colorado:    1191
dtype: object

# Create an array to convert to dataframe and write file

In [145]:
array = np.arange(10)
array

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [242]:
blank = np.zeros((5,5))
blank

array([[0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0.]])

In [245]:
df = pd.DataFrame(data=blank, index=['A','B','C','D','E'], columns=['1','2','3','4','5'])

In [246]:
df

     1    2    3    4    5
A  0.0  0.0  0.0  0.0  0.0
B  0.0  0.0  0.0  0.0  0.0
C  0.0  0.0  0.0  0.0  0.0
D  0.0  0.0  0.0  0.0  0.0
E  0.0  0.0  0.0  0.0  0.0

In [209]:
def pointgen(board):
    row = random.randint(0,4)
    col = random.randint(0,4)
    board.iloc[row][col] = 1
    return board

In [248]:
def multipointgen(n, board):
    values = 0
    while values<n:
        row = random.randint(0,4)
        col = random.randint(0,4)
        values += 1
        board.iloc[row][col] = 1
    return board

In [249]:
multipointgen(5,df)

     1    2    3    4    5
A  0.0  0.0  0.0  0.0  1.0
B  0.0  0.0  0.0  1.0  1.0
C  1.0  0.0  0.0  0.0  0.0
D  0.0  0.0  0.0  0.0  1.0
E  0.0  0.0  0.0  0.0  0.0

In [254]:
df.to_csv(r"C:\Users\Annabel\Documents\Code\practiceprojects\dftest.csv")

In [255]:
pd.read_csv(r"C:\Users\Annabel\Documents\Code\practiceprojects\dftest.csv")

  Unnamed: 0    1    2    3    4    5
0          A  0.0  0.0  0.0  0.0  1.0
1          B  0.0  0.0  0.0  1.0  1.0
2          C  1.0  0.0  0.0  0.0  0.0
3          D  0.0  0.0  0.0  0.0  1.0
4          E  0.0  0.0  0.0  0.0  0.0